NeoTeploUNF.АдаптацияНеоТепло/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказПокупателя</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВидЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заметки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ВидыОперацийЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ТипыДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапланироватьОплату</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаРезерв</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияСчетаЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ДополнительныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоСоставленияДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Получил</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отпустил</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтпустилДолжность</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ВариантыЗавершенияЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтмены</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ПричиныОтменыЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьАНТ_Тип</name>
    <type>
      <types>EnumRef.гсгТипТепловойНасос</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьАНТ_ПлощадьДома</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьАНТ_Мощность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьАНТ_Оборудование_Солнечные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>А_Тип</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.гсгТипТепловойНасос</types>
    </type>
  </attributes>
  <attributes>
    <name>А_ПлощадьДома</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>А_Мощность</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>А_Оборудование_Солнечные</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Резерв</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьАНТ_ГруппаИД</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>А_ГруппаИД</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыЗаказчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДатаПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Работы</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>СкидкиНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>ПлатежныйКалендарь</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДатаОплаты</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОплаты</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОплаты</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСОплаты</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьАНТ_РазделыГруппы</name>
    <attributes>
      <name>РазделГруппа</name>
      <type>
        <types>String</types>
        <types>CatalogRef.СправочникГруппыДляКоммерческих</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазделГруппаИД</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>А_РазделыГруппы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>РазделГруппа</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>РазделГруппаИД</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

NeoTeploUNF.АдаптацияНеоТепло/src/Documents/ЗаказПокупателя/ManagerModule.bsl
&После("ДобавитьКомандыПечати")
Процедура АНТ_ДобавитьКомандыПечати(КомандыПечати)
	//Коммерческое
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Коммерческое";
	КомандаПечати.Представление = НСтр("ru='Коммерческое предложение';uk='Комерційна пропозиція'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка,ФормаСпискаДокументов";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.Обработчик = "УправлениеНебольшойФирмойКлиент.ПредложитьЗаполнитьРеквизитыОрганизации";
	КомандаПечати.Порядок = 1;

КонецПроцедуры

&После("Печать")
Процедура АНТ_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Коммерческое") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Коммерческое", "Коммерческое предложение", ПечатьКоммерческое(МассивОбъектов, ОбъектыПечати, "Коммерческое"));
		
	КонецЕсли;
КонецПроцедуры


Функция ПечатьКоммерческое(МассивОбъектов, ОбъектыПечати, ИмяМакета) Экспорт
	
	Перем Ошибки;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ЗаказПокупателя.ВерсияДанных КАК ВерсияДанных,
	|	ЗаказПокупателя.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗаказПокупателя.Номер КАК Номер,
	|	ЗаказПокупателя.Дата КАК Дата,
	|	ЗаказПокупателя.Проведен КАК Проведен,
	|	ЗаказПокупателя.ВидЗаказа КАК ВидЗаказа,
	|	ЗаказПокупателя.Организация КАК Организация,
	|	ЗаказПокупателя.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЗаказПокупателя.Заметки КАК Заметки,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.СостояниеЗаказа КАК СостояниеЗаказа,
	|	ЗаказПокупателя.Договор КАК Договор,
	|	ЗаказПокупателя.ВидОперации КАК ВидОперации,
	|	ЗаказПокупателя.Проект КАК Проект,
	|	ЗаказПокупателя.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ЗаказПокупателя.БанковскийСчет КАК БанковскийСчет,
	|	ЗаказПокупателя.Касса КАК Касса,
	|	ЗаказПокупателя.ЗапланироватьОплату КАК ЗапланироватьОплату,
	|	ЗаказПокупателя.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв,
	|	ЗаказПокупателя.СтруктурнаяЕдиницаПродажи КАК СтруктурнаяЕдиницаПродажи,
	|	ЗаказПокупателя.УсловияСчетаЗаказа КАК УсловияСчетаЗаказа,
	|	ЗаказПокупателя.МестоСоставленияДокумента КАК МестоСоставленияДокумента,
	|	ЗаказПокупателя.Получил КАК Получил,
	|	ЗаказПокупателя.Отпустил КАК Отпустил,
	|	ЗаказПокупателя.ОтпустилДолжность КАК ОтпустилДолжность,
	|	ЗаказПокупателя.Ответственный КАК Ответственный,
	|	ЗаказПокупателя.Автор КАК Автор,
	|	ЗаказПокупателя.ВариантЗавершения КАК ВариантЗавершения,
	|	ЗаказПокупателя.ПричинаОтмены КАК ПричинаОтмены,
	|	ЗаказПокупателя.Комментарий КАК Комментарий,
	|	ЗаказПокупателя.ВалютаДокумента КАК ВалютаДокумента,
	|	ЗаказПокупателя.А_Тип КАК А_Тип,
	|	ЗаказПокупателя.А_ПлощадьДома КАК А_ПлощадьДома,
	|	ЗаказПокупателя.А_Мощность КАК А_Мощность,
	|	ЗаказПокупателя.А_Оборудование_Солнечные КАК А_Оборудование_Солнечные,
	|	ЗаказПокупателя.Запасы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Резерв КАК Резерв,
	|		Количество КАК Количество,
	|		Характеристика КАК Характеристика,
	|		ДатаОтгрузки КАК ДатаОтгрузки,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Всего КАК Всего,
	|		Содержание КАК Содержание,
	|		Номенклатура КАК Номенклатура,
	|		Спецификация КАК Спецификация,
	|		Партия КАК Партия,
	|		ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|		ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|		Цена КАК Цена,
	|		СуммаНДС КАК СуммаНДС,
	|		СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|		Сумма КАК Сумма,
	|		СтавкаНДС КАК СтавкаНДС,
	|		А_ГруппаИД КАК А_ГруппаИД
	|	) КАК Запасы,
	|	ЗаказПокупателя.МатериалыЗаказчика.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ДатаПоступления КАК ДатаПоступления,
	|		Номенклатура КАК Номенклатура,
	|		Характеристика КАК Характеристика,
	|		Количество КАК Количество,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|	) КАК МатериалыЗаказчика,
	|	ЗаказПокупателя.Работы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки
	|	) КАК Работы,
	|	ЗаказПокупателя.СкидкиНаценки.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки
	|	) КАК СкидкиНаценки,
	|	ЗаказПокупателя.ПлатежныйКалендарь.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ДатаОплаты КАК ДатаОплаты,
	|		ПроцентОплаты КАК ПроцентОплаты,
	|		СуммаОплаты КАК СуммаОплаты,
	|		СуммаНДСОплаты КАК СуммаНДСОплаты
	|	) КАК ПлатежныйКалендарь,
	|	ЗаказПокупателя.А_РазделыГруппы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		РазделГруппа КАК РазделГруппа,
	|		РазделГруппаИД КАК РазделГруппаИД
	|	) КАК РазделыГруппы,
	|	ЗаказПокупателя.Представление КАК Представление,
	|	ЗаказПокупателя.МоментВремени КАК МоментВремени
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока Шапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		//ВыборкаСтрокЗапасы = Шапка.Запасы.Выбрать();
		 
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + ИмяМакета + "_" + ИмяМакета;
		
		//ЭтоКомПоОтоплению = Шапка.Ссылка.ВидЗаказа = Справочники.ВидыЗаказовПокупателей.НайтиПоНаименованию("Комерційне по опаленню", Истина);
		ЭтоКомПоСолнечным = ЗначениеЗаполнено(Шапка.А_Оборудование_Солнечные);// Шапка.Ссылка.ВидЗаказа = Справочники.ВидыЗаказовПокупателей.НайтиПоНаименованию("Комерційне по сонячним", Истина);
		//ЭтоКомПоТепловым = Шапка.Ссылка.ВидЗаказа = Справочники.ВидыЗаказовПокупателей.НайтиПоНаименованию("Комерційне по тепловим", Истина);
		//Если ЭтоКомПоОтоплению или ЭтоКомПоТепловым Тогда
		//	ИмяМакета = "Коммерческое";
		//Иначе
		//	ИмяМакета = "Коммерческое_Солнечные";
		//КонецЕсли;
		Если ЭтоКомПоСолнечным Тогда
			ИмяМакета = "Коммерческое_Солнечные";
		Иначе 
			ИмяМакета = "Коммерческое";
		КонецЕсли;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.АНТ_ПФ_MXL_" + ИмяМакета);
		
		КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
		Макет.КодЯзыкаМакета = КодЯзыкаПечать;
		ЕстьСкидки=Ложь;
		ОбластьМакета =Макет.ПолучитьОбласть("Шапка");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если Шапка.Ссылка.Запасы.Итог("ПроцентСкидкиНаценки") <> 0 Тогда
			ЕстьСкидки = Истина;
		КонецЕсли;
		
		Если ЕстьСкидки = Истина Тогда
		ОбластьМакета =Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		Иначе
		ОбластьМакета =Макет.ПолучитьОбласть("ШапкаТаблицыБезСкидки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		ВыборкаСтрокГруппы = Шапка.РазделыГруппы.Выбрать();
		
		ВыборкаСтрокЗапасы = Шапка.Запасы.Выгрузить();
		ОбщаяСкидка=0;
		
		Если ВыборкаСтрокГруппы.КОличество() > 0 Тогда
			Пока ВыборкаСтрокГруппы.Следующий() Цикл
			СуммаСкидкиРаздела=0;
			СуммаИтогРаздела = 0;
			
			ИмяРаздела  = ВыборкаСтрокГруппы.РазделГруппа;
			ИДРаздела = ВыборкаСтрокГруппы.РазделГруппаИД;
			СтруктураДляПоиска = Новый Структура("А_ГруппаИД", Строка(ИДРаздела)); 
			
			МассивНайденныхСтрок = ВыборкаСтрокЗапасы.НайтиСтроки(СтруктураДляПоиска); 
			Если МассивНайденныхСтрок.Количество() >  0 Тогда
				ОбластьМакета =Макет.ПолучитьОбласть("ИмяРаздела");
				ОбластьМакета.Параметры.ИмяРаздела = ИмяРаздела;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				//выводим товары раздела
				
				Для каждого Строка Из МассивНайденныхСтрок Цикл 
					Если ЕстьСкидки = Ложь Тогда
						ОбластьМакета =Макет.ПолучитьОбласть("Строка");
					Иначе
						ОбластьМакета =Макет.ПолучитьОбласть("СтрокаСоСкидкой");
					КонецЕсли;
					
					ОбластьМакета.Параметры.Заполнить(Строка);
					Если ЕстьСкидки = Истина Тогда
						ОбластьМакета.Параметры.Скидка = Окр(Строка.Количество*Строка.Цена*(Строка.ПроцентСкидкиНаценки/100),2,РежимОкругления.Окр15как10);
						СуммаСкидкиРаздела = СуммаСкидкиРаздела + Окр(Строка.Количество*Строка.Цена*(Строка.ПроцентСкидкиНаценки/100),2,РежимОкругления.Окр15как10);
						//ОбщаяСкидка =ОбщаяСкидка +  СуммаСкидкиРаздела;
					КонецЕсли;
					СуммаИтогРаздела = СуммаИтогРаздела + Строка.Сумма;
					ТабличныйДокумент.Вывести(ОбластьМакета); 
					
				КонецЦикла;
				//выводим итоги раздела
				
				ОбщаяСкидка =ОбщаяСкидка +  СуммаСкидкиРаздела;
				Если ЕстьСкидки = Ложь Тогда
					ОбластьМакета =Макет.ПолучитьОбласть("ИтогРаздела");
					ОбластьМакета.Параметры.СуммаРаздела = СуммаИтогРаздела;
				Иначе
					ОбластьМакета =Макет.ПолучитьОбласть("ИтогРазделаСоСкидкой");
					ОбластьМакета.Параметры.СуммаСкидки = СуммаСкидкиРаздела;
					ОбластьМакета.Параметры.СуммаРаздела = СуммаИтогРаздела;
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЕсли; 
			
		КонецЦикла; 
	Иначе
		 //выводим товары раздела
				
		 Для каждого Строка Из ВыборкаСтрокЗапасы Цикл
			 СуммаСкидкиРаздела=0;

					Если ЕстьСкидки = Ложь Тогда
						ОбластьМакета =Макет.ПолучитьОбласть("Строка");
					Иначе
						ОбластьМакета =Макет.ПолучитьОбласть("СтрокаСоСкидкой");
					КонецЕсли;
					
					ОбластьМакета.Параметры.Заполнить(Строка);
					Если ЕстьСкидки = Истина Тогда
						ОбластьМакета.Параметры.Скидка = Окр(Строка.Количество*Строка.Цена*(Строка.ПроцентСкидкиНаценки/100),2,РежимОкругления.Окр15как10);
						СуммаСкидкиРаздела = СуммаСкидкиРаздела + Окр(Строка.Количество*Строка.Цена*(Строка.ПроцентСкидкиНаценки/100),2,РежимОкругления.Окр15как10);
						ОбщаяСкидка =ОбщаяСкидка +  СуммаСкидкиРаздела;
					КонецЕсли;
					//СуммаИтогРаздела = СуммаИтогРаздела + Строка.Сумма;
					ТабличныйДокумент.Вывести(ОбластьМакета); 
					
				КонецЦикла;
		КонецЕсли; 
		
		
		Если ЕстьСкидки = Ложь Тогда
			ОбластьМакета =Макет.ПолучитьОбласть("Итог");
		Иначе
			ОбластьМакета =Макет.ПолучитьОбласть("ИтогСоСкидкой");
			ОбластьМакета.Параметры.ОбщаяСкидка = ОбщаяСкидка;
		КонецЕсли;
		ОбластьМакета.Параметры.Итого = Шапка.Ссылка.Запасы.Итог("Сумма");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	Возврат ТабличныйДокумент;
	КонецЦикла;	
		
КонецФункции // ПечатнаяФорма()
